---
title: MEPModel
classe: Autodesk.Revit.DB.MEPModel
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# MEPModel

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ConnectorManager ConnectorManager { get; }` | `mEPModel.ConnectorManager` | ConnectorManager |
| `Boolean IsValidObject { get; }` | `mEPModel.IsValidObject` | Boolean |
| `ISet<ElectricalSystem> GetAssignedElectricalSystems()` | `mEPModel.GetAssignedElectricalSystems()` | ISet<ElectricalSystem> |
| `ISet<ElectricalSystem> GetElectricalSystems()` | `mEPModel.GetElectricalSystems()` | ISet<ElectricalSystem> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```